/*


Как вы знаете, самым минимальным днем месяца является день с номером 1. 
Поэтому, если указать день с номером 0,
 то получится последний день предыдущего месяца

 Можно также указывать отрицательные значения дней и месяцев.
  При этом нужно помнить, что минимальный день имеет номер 1, а минимальный месяц - номер 0. 
  Это значит, что минус первый день попадает во 2 день с конца предыдущего месяца, 
 а минус первый месяц попадает просто в последний месяц предыдущего года
*/

// let date = new Date(2018, 33, 33);
// console.log(date); // какая дата будет?